# conda environments:
#
                         /scratch/cc6580/share/digit/digit_env
                      *  /scratch/cc6580/share/inversion_example/inversion_env
base                     /share/apps/anaconda3/5.3.1

2020-06-09 04:12:27.324688: I tensorflow/core/platform/cpu_feature_guard.cc:143] Your CPU supports instructions that this TensorFlow binary was not compiled to use: SSE4.1 SSE4.2 AVX AVX2 FMA
2020-06-09 04:12:27.330856: I tensorflow/core/platform/profile_utils/cpu_utils.cc:102] CPU Frequency: 2600025000 Hz
2020-06-09 04:12:27.331038: I tensorflow/compiler/xla/service/service.cc:168] XLA service 0x2b1bc74a99f0 initialized for platform Host (this does not guarantee that XLA will be used). Devices:
2020-06-09 04:12:27.331098: I tensorflow/compiler/xla/service/service.cc:176]   StreamExecutor device (0): Host, Default Version
2020-06-09 04:12:27.331244: I tensorflow/core/common_runtime/process_util.cc:147] Creating new thread pool with default inter op setting: 2. Tune using inter_op_parallelism_threads for best performance.
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 64, 32, 2)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 64, 32, 8)    152         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 64, 32, 8)    32          conv2d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, 64, 32, 8)    0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 64, 32, 8)    584         activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 64, 32, 8)    32          conv2d_1[0][0]                   
__________________________________________________________________________________________________
dropout (Dropout)               (None, 64, 32, 8)    0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 64, 32, 8)    0           dropout[0][0]                    
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 32, 16, 8)    0           activation_1[0][0]               
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 16, 16)   1168        max_pooling2d[0][0]              
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 32, 16, 16)   64          conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 32, 16, 16)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 16, 16)   2320        activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 32, 16, 16)   64          conv2d_3[0][0]                   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 32, 16, 16)   0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 32, 16, 16)   0           dropout_1[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 16, 8, 16)    0           activation_3[0][0]               
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 16, 8, 32)    4640        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 16, 8, 32)    128         conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 16, 8, 32)    0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 16, 8, 32)    9248        activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 16, 8, 32)    128         conv2d_5[0][0]                   
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 16, 8, 32)    0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 16, 8, 32)    0           dropout_2[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 8, 4, 32)     0           activation_5[0][0]               
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 8, 4, 64)     18496       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 8, 4, 64)     256         conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 8, 4, 64)     0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 8, 4, 64)     36928       activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 8, 4, 64)     256         conv2d_7[0][0]                   
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 8, 4, 64)     0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 8, 4, 64)     0           dropout_3[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 4, 2, 64)     0           activation_7[0][0]               
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 4, 2, 128)    73856       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 4, 2, 128)    512         conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 4, 2, 128)    0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 4, 2, 128)    147584      activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 4, 2, 128)    512         conv2d_9[0][0]                   
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 4, 2, 128)    0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 4, 2, 128)    0           dropout_4[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 8, 4, 64)     32832       activation_9[0][0]               
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 8, 4, 128)    0           activation_7[0][0]               
                                                                 conv2d_transpose[0][0]           
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 8, 4, 64)     73792       concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 8, 4, 64)     256         conv2d_10[0][0]                  
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 8, 4, 64)     0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 8, 4, 64)     0           dropout_5[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 8, 4, 64)     36928       activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 8, 4, 64)     256         conv2d_11[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 8, 4, 64)     0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 16, 8, 32)    8224        activation_11[0][0]              
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 16, 8, 64)    0           activation_5[0][0]               
                                                                 conv2d_transpose_1[0][0]         
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 16, 8, 32)    18464       concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 16, 8, 32)    128         conv2d_12[0][0]                  
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 16, 8, 32)    0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 16, 8, 32)    0           dropout_6[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 16, 8, 32)    9248        activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 16, 8, 32)    128         conv2d_13[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 16, 8, 32)    0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 32, 16, 16)   2064        activation_13[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 32, 16, 32)   0           activation_3[0][0]               
                                                                 conv2d_transpose_2[0][0]         
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 32, 16, 16)   4624        concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 32, 16, 16)   64          conv2d_14[0][0]                  
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 32, 16, 16)   0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 32, 16, 16)   0           dropout_7[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 32, 16, 16)   2320        activation_14[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 32, 16, 16)   64          conv2d_15[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 32, 16, 16)   0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 32, 16, 3)    51          activation_15[0][0]              
==================================================================================================
Total params: 486,403
Trainable params: 484,963
Non-trainable params: 1,440
__________________________________________________________________________________________________
Epoch 1/10
y_pred shape: (32, 16)
y_pred shape: (32, 16)
 1/40 [..............................] - ETA: 0s - loss: 0.7352 2/40 [>.............................] - ETA: 1s - loss: 0.6949 3/40 [=>............................] - ETA: 2s - loss: 0.6557 4/40 [==>...........................] - ETA: 2s - loss: 0.6225 5/40 [==>...........................] - ETA: 2s - loss: 0.5929 6/40 [===>..........................] - ETA: 2s - loss: 0.5654 7/40 [====>.........................] - ETA: 2s - loss: 0.5397 8/40 [=====>........................] - ETA: 2s - loss: 0.5168 9/40 [=====>........................] - ETA: 2s - loss: 0.493910/40 [======>.......................] - ETA: 2s - loss: 0.472611/40 [=======>......................] - ETA: 2s - loss: 0.452112/40 [========>.....................] - ETA: 2s - loss: 0.432413/40 [========>.....................] - ETA: 2s - loss: 0.415214/40 [=========>....................] - ETA: 2s - loss: 0.399015/40 [==========>...................] - ETA: 3s - loss: 0.383216/40 [===========>..................] - ETA: 3s - loss: 0.368217/40 [===========>..................] - ETA: 3s - loss: 0.354818/40 [============>.................] - ETA: 3s - loss: 0.342119/40 [=============>................] - ETA: 3s - loss: 0.330420/40 [==============>...............] - ETA: 3s - loss: 0.319721/40 [==============>...............] - ETA: 3s - loss: 0.309622/40 [===============>..............] - ETA: 3s - loss: 0.300123/40 [================>.............] - ETA: 3s - loss: 0.291124/40 [=================>............] - ETA: 2s - loss: 0.282425/40 [=================>............] - ETA: 2s - loss: 0.274726/40 [==================>...........] - ETA: 2s - loss: 0.266927/40 [===================>..........] - ETA: 2s - loss: 0.259728/40 [====================>.........] - ETA: 2s - loss: 0.252829/40 [====================>.........] - ETA: 2s - loss: 0.246530/40 [=====================>........] - ETA: 2s - loss: 0.240131/40 [======================>.......] - ETA: 1s - loss: 0.234332/40 [=======================>......] - ETA: 1s - loss: 0.228833/40 [=======================>......] - ETA: 1s - loss: 0.223534/40 [========================>.....] - ETA: 1s - loss: 0.218336/40 [==========================>...] - ETA: 0s - loss: 0.208838/40 [===========================>..] - ETA: 0s - loss: 0.200140/40 [==============================] - ETA: 0s - loss: 0.192040/40 [==============================] - 7s 186ms/step - loss: 0.1920
Epoch 2/10
 1/40 [..............................] - ETA: 0s - loss: 0.0386 2/40 [>.............................] - ETA: 0s - loss: 0.0348 4/40 [==>...........................] - ETA: 1s - loss: 0.0334 6/40 [===>..........................] - ETA: 1s - loss: 0.0330 8/40 [=====>........................] - ETA: 1s - loss: 0.031710/40 [======>.......................] - ETA: 1s - loss: 0.030512/40 [========>.....................] - ETA: 1s - loss: 0.029614/40 [=========>....................] - ETA: 1s - loss: 0.028416/40 [===========>..................] - ETA: 1s - loss: 0.027518/40 [============>.................] - ETA: 0s - loss: 0.026820/40 [==============>...............] - ETA: 0s - loss: 0.025922/40 [===============>..............] - ETA: 0s - loss: 0.025224/40 [=================>............] - ETA: 0s - loss: 0.024526/40 [==================>...........] - ETA: 0s - loss: 0.024028/40 [====================>.........] - ETA: 0s - loss: 0.023330/40 [=====================>........] - ETA: 0s - loss: 0.022932/40 [=======================>......] - ETA: 0s - loss: 0.022433/40 [=======================>......] - ETA: 0s - loss: 0.022135/40 [=========================>....] - ETA: 0s - loss: 0.021737/40 [==========================>...] - ETA: 0s - loss: 0.021239/40 [============================>.] - ETA: 0s - loss: 0.020840/40 [==============================] - 2s 45ms/step - loss: 0.0207
Epoch 3/10
 1/40 [..............................] - ETA: 0s - loss: 0.0137 3/40 [=>............................] - ETA: 1s - loss: 0.0126 5/40 [==>...........................] - ETA: 1s - loss: 0.0121 6/40 [===>..........................] - ETA: 1s - loss: 0.0118 8/40 [=====>........................] - ETA: 1s - loss: 0.011610/40 [======>.......................] - ETA: 1s - loss: 0.011712/40 [========>.....................] - ETA: 1s - loss: 0.011514/40 [=========>....................] - ETA: 1s - loss: 0.011416/40 [===========>..................] - ETA: 1s - loss: 0.011217/40 [===========>..................] - ETA: 1s - loss: 0.011119/40 [=============>................] - ETA: 0s - loss: 0.011020/40 [==============>...............] - ETA: 0s - loss: 0.011022/40 [===============>..............] - ETA: 0s - loss: 0.010924/40 [=================>............] - ETA: 0s - loss: 0.010726/40 [==================>...........] - ETA: 0s - loss: 0.010627/40 [===================>..........] - ETA: 0s - loss: 0.010528/40 [====================>.........] - ETA: 0s - loss: 0.010530/40 [=====================>........] - ETA: 0s - loss: 0.010432/40 [=======================>......] - ETA: 0s - loss: 0.010333/40 [=======================>......] - ETA: 0s - loss: 0.010234/40 [========================>.....] - ETA: 0s - loss: 0.010236/40 [==========================>...] - ETA: 0s - loss: 0.010038/40 [===========================>..] - ETA: 0s - loss: 0.009939/40 [============================>.] - ETA: 0s - loss: 0.009940/40 [==============================] - 2s 45ms/step - loss: 0.0098
Epoch 4/10
 1/40 [..............................] - ETA: 0s - loss: 0.0076 2/40 [>.............................] - ETA: 0s - loss: 0.0077 3/40 [=>............................] - ETA: 1s - loss: 0.0076 5/40 [==>...........................] - ETA: 1s - loss: 0.0075 7/40 [====>.........................] - ETA: 1s - loss: 0.0073 9/40 [=====>........................] - ETA: 1s - loss: 0.007210/40 [======>.......................] - ETA: 1s - loss: 0.007111/40 [=======>......................] - ETA: 1s - loss: 0.007013/40 [========>.....................] - ETA: 1s - loss: 0.007014/40 [=========>....................] - ETA: 1s - loss: 0.006915/40 [==========>...................] - ETA: 1s - loss: 0.006917/40 [===========>..................] - ETA: 0s - loss: 0.006819/40 [=============>................] - ETA: 0s - loss: 0.006821/40 [==============>...............] - ETA: 0s - loss: 0.006722/40 [===============>..............] - ETA: 0s - loss: 0.006724/40 [=================>............] - ETA: 0s - loss: 0.006626/40 [==================>...........] - ETA: 0s - loss: 0.006527/40 [===================>..........] - ETA: 0s - loss: 0.006529/40 [====================>.........] - ETA: 0s - loss: 0.006431/40 [======================>.......] - ETA: 0s - loss: 0.006433/40 [=======================>......] - ETA: 0s - loss: 0.006334/40 [========================>.....] - ETA: 0s - loss: 0.006336/40 [==========================>...] - ETA: 0s - loss: 0.006237/40 [==========================>...] - ETA: 0s - loss: 0.006238/40 [===========================>..] - ETA: 0s - loss: 0.006240/40 [==============================] - ETA: 0s - loss: 0.006140/40 [==============================] - 2s 46ms/step - loss: 0.0061
Epoch 5/10
 1/40 [..............................] - ETA: 0s - loss: 0.0050 2/40 [>.............................] - ETA: 0s - loss: 0.0052 4/40 [==>...........................] - ETA: 1s - loss: 0.0049 6/40 [===>..........................] - ETA: 1s - loss: 0.0048 8/40 [=====>........................] - ETA: 1s - loss: 0.0049 9/40 [=====>........................] - ETA: 1s - loss: 0.004811/40 [=======>......................] - ETA: 1s - loss: 0.004812/40 [========>.....................] - ETA: 1s - loss: 0.004714/40 [=========>....................] - ETA: 1s - loss: 0.004716/40 [===========>..................] - ETA: 1s - loss: 0.004717/40 [===========>..................] - ETA: 0s - loss: 0.004719/40 [=============>................] - ETA: 0s - loss: 0.004620/40 [==============>...............] - ETA: 0s - loss: 0.004622/40 [===============>..............] - ETA: 0s - loss: 0.004524/40 [=================>............] - ETA: 0s - loss: 0.004425/40 [=================>............] - ETA: 0s - loss: 0.004427/40 [===================>..........] - ETA: 0s - loss: 0.004429/40 [====================>.........] - ETA: 0s - loss: 0.004331/40 [======================>.......] - ETA: 0s - loss: 0.004332/40 [=======================>......] - ETA: 0s - loss: 0.004334/40 [========================>.....] - ETA: 0s - loss: 0.004236/40 [==========================>...] - ETA: 0s - loss: 0.004238/40 [===========================>..] - ETA: 0s - loss: 0.004239/40 [============================>.] - ETA: 0s - loss: 0.004240/40 [==============================] - 2s 44ms/step - loss: 0.0042
Epoch 6/10
 1/40 [..............................] - ETA: 0s - loss: 0.0033 3/40 [=>............................] - ETA: 1s - loss: 0.0033 4/40 [==>...........................] - ETA: 1s - loss: 0.0033 5/40 [==>...........................] - ETA: 1s - loss: 0.0033 7/40 [====>.........................] - ETA: 1s - loss: 0.0033 9/40 [=====>........................] - ETA: 1s - loss: 0.003311/40 [=======>......................] - ETA: 1s - loss: 0.003212/40 [========>.....................] - ETA: 1s - loss: 0.003213/40 [========>.....................] - ETA: 1s - loss: 0.003214/40 [=========>....................] - ETA: 1s - loss: 0.003216/40 [===========>..................] - ETA: 1s - loss: 0.003217/40 [===========>..................] - ETA: 1s - loss: 0.003119/40 [=============>................] - ETA: 0s - loss: 0.003120/40 [==============>...............] - ETA: 0s - loss: 0.003122/40 [===============>..............] - ETA: 0s - loss: 0.003124/40 [=================>............] - ETA: 0s - loss: 0.003126/40 [==================>...........] - ETA: 0s - loss: 0.003127/40 [===================>..........] - ETA: 0s - loss: 0.003128/40 [====================>.........] - ETA: 0s - loss: 0.003030/40 [=====================>........] - ETA: 0s - loss: 0.003032/40 [=======================>......] - ETA: 0s - loss: 0.003034/40 [========================>.....] - ETA: 0s - loss: 0.003035/40 [=========================>....] - ETA: 0s - loss: 0.003036/40 [==========================>...] - ETA: 0s - loss: 0.003038/40 [===========================>..] - ETA: 0s - loss: 0.002940/40 [==============================] - ETA: 0s - loss: 0.002940/40 [==============================] - 2s 46ms/step - loss: 0.0029
Epoch 7/10
 1/40 [..............................] - ETA: 0s - loss: 0.0028 3/40 [=>............................] - ETA: 1s - loss: 0.0025 5/40 [==>...........................] - ETA: 1s - loss: 0.0025 7/40 [====>.........................] - ETA: 1s - loss: 0.0025 9/40 [=====>........................] - ETA: 1s - loss: 0.002510/40 [======>.......................] - ETA: 1s - loss: 0.002512/40 [========>.....................] - ETA: 1s - loss: 0.002413/40 [========>.....................] - ETA: 1s - loss: 0.002414/40 [=========>....................] - ETA: 1s - loss: 0.002415/40 [==========>...................] - ETA: 1s - loss: 0.002417/40 [===========>..................] - ETA: 1s - loss: 0.002418/40 [============>.................] - ETA: 0s - loss: 0.002420/40 [==============>...............] - ETA: 0s - loss: 0.002321/40 [==============>...............] - ETA: 0s - loss: 0.002322/40 [===============>..............] - ETA: 0s - loss: 0.002324/40 [=================>............] - ETA: 0s - loss: 0.002326/40 [==================>...........] - ETA: 0s - loss: 0.002328/40 [====================>.........] - ETA: 0s - loss: 0.002329/40 [====================>.........] - ETA: 0s - loss: 0.002331/40 [======================>.......] - ETA: 0s - loss: 0.002233/40 [=======================>......] - ETA: 0s - loss: 0.002235/40 [=========================>....] - ETA: 0s - loss: 0.002236/40 [==========================>...] - ETA: 0s - loss: 0.002238/40 [===========================>..] - ETA: 0s - loss: 0.002240/40 [==============================] - ETA: 0s - loss: 0.002240/40 [==============================] - 2s 45ms/step - loss: 0.0022
Epoch 8/10
 1/40 [..............................] - ETA: 0s - loss: 0.0018 2/40 [>.............................] - ETA: 1s - loss: 0.0019 3/40 [=>............................] - ETA: 1s - loss: 0.0019 4/40 [==>...........................] - ETA: 1s - loss: 0.0019 6/40 [===>..........................] - ETA: 1s - loss: 0.0019 8/40 [=====>........................] - ETA: 1s - loss: 0.0019 9/40 [=====>........................] - ETA: 1s - loss: 0.001810/40 [======>.......................] - ETA: 1s - loss: 0.001812/40 [========>.....................] - ETA: 1s - loss: 0.001813/40 [========>.....................] - ETA: 1s - loss: 0.001814/40 [=========>....................] - ETA: 1s - loss: 0.001815/40 [==========>...................] - ETA: 1s - loss: 0.001717/40 [===========>..................] - ETA: 1s - loss: 0.001719/40 [=============>................] - ETA: 0s - loss: 0.001720/40 [==============>...............] - ETA: 0s - loss: 0.001722/40 [===============>..............] - ETA: 0s - loss: 0.001624/40 [=================>............] - ETA: 0s - loss: 0.001626/40 [==================>...........] - ETA: 0s - loss: 0.001628/40 [====================>.........] - ETA: 0s - loss: 0.001629/40 [====================>.........] - ETA: 0s - loss: 0.001630/40 [=====================>........] - ETA: 0s - loss: 0.001632/40 [=======================>......] - ETA: 0s - loss: 0.001634/40 [========================>.....] - ETA: 0s - loss: 0.001636/40 [==========================>...] - ETA: 0s - loss: 0.001637/40 [==========================>...] - ETA: 0s - loss: 0.001638/40 [===========================>..] - ETA: 0s - loss: 0.001540/40 [==============================] - ETA: 0s - loss: 0.001540/40 [==============================] - 2s 45ms/step - loss: 0.0015
Epoch 9/10
 1/40 [..............................] - ETA: 0s - loss: 0.0013 3/40 [=>............................] - ETA: 1s - loss: 0.0013 4/40 [==>...........................] - ETA: 1s - loss: 0.0013 6/40 [===>..........................] - ETA: 1s - loss: 0.0013 8/40 [=====>........................] - ETA: 1s - loss: 0.0013 9/40 [=====>........................] - ETA: 1s - loss: 0.001311/40 [=======>......................] - ETA: 1s - loss: 0.001313/40 [========>.....................] - ETA: 1s - loss: 0.001215/40 [==========>...................] - ETA: 1s - loss: 0.001217/40 [===========>..................] - ETA: 0s - loss: 0.001219/40 [=============>................] - ETA: 0s - loss: 0.001221/40 [==============>...............] - ETA: 0s - loss: 0.001223/40 [================>.............] - ETA: 0s - loss: 0.001225/40 [=================>............] - ETA: 0s - loss: 0.001227/40 [===================>..........] - ETA: 0s - loss: 0.001229/40 [====================>.........] - ETA: 0s - loss: 0.001231/40 [======================>.......] - ETA: 0s - loss: 0.001233/40 [=======================>......] - ETA: 0s - loss: 0.001235/40 [=========================>....] - ETA: 0s - loss: 0.001237/40 [==========================>...] - ETA: 0s - loss: 0.001139/40 [============================>.] - ETA: 0s - loss: 0.001140/40 [==============================] - 2s 41ms/step - loss: 0.0011
Epoch 10/10
 1/40 [..............................] - ETA: 0s - loss: 9.3393e-04 3/40 [=>............................] - ETA: 1s - loss: 9.6175e-04 5/40 [==>...........................] - ETA: 1s - loss: 9.6595e-04 7/40 [====>.........................] - ETA: 1s - loss: 9.8956e-04 9/40 [=====>........................] - ETA: 1s - loss: 9.9471e-0411/40 [=======>......................] - ETA: 1s - loss: 9.9673e-0413/40 [========>.....................] - ETA: 1s - loss: 0.0010    15/40 [==========>...................] - ETA: 0s - loss: 0.001017/40 [===========>..................] - ETA: 0s - loss: 0.001019/40 [=============>................] - ETA: 0s - loss: 0.001021/40 [==============>...............] - ETA: 0s - loss: 0.001023/40 [================>.............] - ETA: 0s - loss: 0.001025/40 [=================>............] - ETA: 0s - loss: 0.001027/40 [===================>..........] - ETA: 0s - loss: 0.001029/40 [====================>.........] - ETA: 0s - loss: 0.001031/40 [======================>.......] - ETA: 0s - loss: 9.9801e-0433/40 [=======================>......] - ETA: 0s - loss: 9.9480e-0435/40 [=========================>....] - ETA: 0s - loss: 9.9211e-0437/40 [==========================>...] - ETA: 0s - loss: 9.9277e-0439/40 [============================>.] - ETA: 0s - loss: 9.8927e-0440/40 [==============================] - 2s 40ms/step - loss: 9.8861e-04
